app/controllers/photos_controller.rb

INSERT INTO "photos" ("created_at", "photo_content_type", "photo_file_name", "photo_file_size", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @photo = Photo.new(params[:photo])

    respond_to do |format|
      if @photo.save